{
    "heading": {
        "message": "Portfolio"
    },
    "sub-heading": {
        "paragraph1": "Throughout my Undergraduate studies, I have learnt and produced many artefacts. These artefacts include, but are not limited to, games and digital illustrations.",
        "paragraph2": "In this page, you will be able to see the artefacts that I have created for both my academics and leisure."
    },
    "portfolio1": {
        "title": "1. Dissertation Project",
        "description": "Introducing Loop Structures to Enhance Procedural Dungeon Generation"
    },
    "portfolio2": {
        "title": "2. FPS Reaction Practice",
        "description": "A simple game to train your flash dodging in Valorant"
    },
    "portfolio3": {
        "title": "3. Initial Truth Game",
        "description": "A simple STG/Shoot 'em up game mixed with real-time turn based mechanics"
    },
    "about": {
        "heading": "Hello!",
        "paragraph1": "My name is William Moses. I am a Newcastle University graduate with a Bachelor of Science (BSc) Bachelor's degree in Computer Science, specialised in Game Engineering. I studied at Newcastle University in Newcastle upon Tyne, UK.",
        "paragraph2": "Art comes in many shapes and forms: paintings, sculptures, music, films, literature, and many more. However, although the popularity of video games are rising, it is still not widely accepted as a form of art.",
        "paragraph3": "I have always been fascinated by video games since I was young. One of the games that left a huge impression on me was Pokémon Platinum on the Nintendo DS. It is one of the reasons why I grew to love video games.",
        "paragraph4": "Back then, video games are a form of entertainment yet it evolved in such a fast pace into what it is now. I believe that video games are just like movies, but interactive. This allows us to interact and to be more immersed in the narrative of the game.",
        "paragraph5": "As a game engineer, I aim to contribute to the game industry by being involved in the creation of superb, interactive, and memorable video games in order to bring the values of video games to light!"
    }
}